#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + client_id                               = "4cff7979-1a61-4439-be91-64e56065da8a"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "Azure"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod"  = "client_secret_post"
          + "forwardParameters" = ""
          + "tooltip"           = ""
        }
      + first_broker_login_flow_alias           = "first broker login"
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + link_only                               = false
      + login_hint                              = "false"
      + provider_id                             = "oidc"
      + realm                                   = "ISB"
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://login.microsoftonline.com/6fdb5200-3d0d-4a8a-b036-d3685e359adc/oauth2/v2.0/token"
      + trust_email                             = false
      + ui_locales                              = false
      + validate_signature                      = true
    }

  # module.COMMON_SSO_DEV.module.ISB.module.JAM-RCC-AUTHN.module.client-roles.keycloak_role.ROLES["agencyDetailGet"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "agencyDetailGet"
      + realm_id  = "ISB"
    }

  # module.COMMON_SSO_DEV.module.ISB.module.JAM-RCC-AUTHN.module.client-roles.keycloak_role.ROLES["agencyDutyTypeDelete"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "agencyDutyTypeDelete"
      + realm_id  = "ISB"
    }

  # module.COMMON_SSO_DEV.module.ISB.module.JAM-RCC-AUTHN.module.client-roles.keycloak_role.ROLES["agencyDutyTypeGet"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "agencyDutyTypeGet"
      + realm_id  = "ISB"
    }

  # module.COMMON_SSO_DEV.module.ISB.module.JAM-RCC-AUTHN.module.client-roles.keycloak_role.ROLES["agencyDutyTypeSave"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "agencyDutyTypeSave"
      + realm_id  = "ISB"
    }

  # module.COMMON_SSO_DEV.module.ISB.module.JAM-RCC-AUTHN.module.client-roles.keycloak_role.ROLES["particAssignmentGet"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "particAssignmentGet"
      + realm_id  = "ISB"
    }

  # module.COMMON_SSO_DEV.module.ISB.module.JAM-RCC-AUTHN.module.justin_claim.keycloak_generic_protocol_mapper.justin_claim_mapper will be created
  + resource "keycloak_generic_protocol_mapper" "justin_claim_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                = "true"
          + "claim.name"                        = "justin:participant"
          + "client.auth.id"                    = "justin-participant-client"
          + "client.auth.pass"                  = "testing_auth_pass"
          + "client.auth.url"                   = "https://sso-e27db1-dev.apps.gold.devops.gov.bc.ca/auth/realms/DEMS/protocol/openid-connect/token"
          + "debugging.remote.disabled"         = "true"
          + "id.token.claim"                    = "true"
          + "remote.headers.bearer.token"       = "true"
          + "remote.parameters.clientid"        = "false"
          + "remote.parameters.user.attributes" = "firstname&lastName&email"
          + "remote.parameters.username"        = "true"
          + "remote.request.retry"              = "true"
          + "remote.url"                        = "https://custom-claim-api-e648d1-dev.apps.emerald.devops.gov.bc.ca/api/participant"
          + "userinfo.token.claim"              = "true"
        }
      + id              = (known after apply)
      + name            = "justin-participant"
      + protocol        = "openid-connect"
      + protocol_mapper = "json-remote-claim"
      + realm_id        = "ISB"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sookeke, Action: `pull_request`*